# Brewfile - Homebrew packages for macOS
# Install with: brew bundle --file=Brewfile
# Check what's missing: brew bundle check
# Clean up unlisted packages: brew bundle cleanup

# --- Taps ---
tap "coursier/formulas"

# --- Core CLI Tools ---
brew "coreutils"        # GNU core utilities (gdate, gls, etc.)
brew "fd"               # Fast find alternative
brew "fzf"              # Fuzzy finder
brew "grep"             # GNU grep (macOS grep is BSD)
brew "htop"             # Interactive process viewer
brew "btop"             # Resource monitor (prettier htop)
brew "jq"               # JSON processor
brew "ncdu"             # Disk usage analyzer
brew "ripgrep"          # Fast grep (rg)
brew "tree"             # Directory listing as tree
brew "watch"            # Run commands periodically
brew "wget"             # HTTP fetcher
brew "entr"             # Run commands on file changes
brew "dos2unix"         # Line ending conversion
brew "p7zip"            # 7zip archive support
brew "gawk"             # GNU awk
brew "cloc"             # Count lines of code
brew "bat"              # cat with syntax highlighting
brew "eza"              # Modern ls replacement (git integration, icons)
brew "zoxide"           # Smarter cd that learns your directories
brew "tlrc"             # tldr client - simplified man pages
brew "duf"              # Modern df replacement
brew "curlie"           # curl with httpie-style output
brew "bandwhich"        # Bandwidth monitor by process/connection

# --- Shell & Terminal ---
brew "fish"             # Fish shell
brew "tmux"             # Terminal multiplexer
brew "mosh"             # Mobile shell (persistent SSH)

# --- Git & Version Control ---
brew "git"
brew "git-lfs"
brew "gh"               # GitHub CLI
brew "lazygit"          # Terminal UI for git

# --- Editors ---
brew "vim"
brew "neovim"

# --- Version Managers ---
brew "asdf"             # Multi-runtime version manager

# --- Ruby / Rails ---
brew "vips"             # Image processing (Rails ActiveStorage)
brew "imagemagick"      # Image manipulation
brew "postgresql@18"    # PostgreSQL database
brew "redis"            # Key-value store

# --- Languages & Runtimes ---
brew "rust"
brew "elixir"
brew "crystal"
brew "ghc"              # Haskell compiler
brew "sbcl"             # Common Lisp
brew "minimal-racket"   # Racket/Scheme
brew "luarocks"         # Lua package manager
brew "coursier/formulas/coursier"  # Scala/JVM launcher
brew "openjdk"          # Java runtime
brew "pipx"             # Python CLI tool installer

# --- Infrastructure & DevOps ---
brew "awscli"
brew "aws-vault"        # AWS credential management
brew "terraform-docs"
brew "tfenv"            # Terraform version manager
brew "tflint"           # Terraform linter
brew "tfsec"            # Terraform security scanner
brew "direnv"           # Per-directory environment variables
brew "podman"           # Container engine (Docker alternative)
brew "dive"             # Docker image layer explorer
brew "lazydocker"       # Terminal UI for Docker
brew "minikube"         # Local Kubernetes

# --- Networking & Security ---
brew "nmap"             # Network scanner
brew "mtr"              # Traceroute + ping
brew "qrencode"         # QR code generator
brew "gnupg"            # GPG encryption

# --- Search & Analysis ---
brew "ast-grep"         # Structural code search
brew "snitch"           # TODO/FIXME tracker

# --- Media ---
brew "ffmpeg"           # Video/audio processing
brew "yt-dlp"           # Video downloader
brew "graphviz"         # Graph visualization (dot)

# --- AI / LLM ---
brew "ollama"           # Local LLM runner
brew "gemini-cli"       # Google Gemini CLI

# --- Other ---
brew "astroterm"        # Terminal astronomy
brew "cmatrix"          # Matrix screensaver
brew "cmake"            # Build system
brew "composer"         # PHP dependency manager
brew "glow"             # Terminal markdown renderer
brew "oha"              # HTTP load testing
brew "opensearch"       # Search engine
brew "termscp"          # Terminal file transfer
brew "weechat"          # IRC client
brew "automake"         # Build tool
brew "qemu"             # Machine emulator
brew "urh"              # Universal Radio Hacker
brew "internetarchive"  # Internet Archive CLI

# --- Casks (GUI Applications) ---
cask "calibre"          # E-book manager
cask "codex"            # OpenAI Codex CLI
cask "ghidra"           # Reverse engineering
cask "gqrx"            # Software defined radio
cask "mitmproxy"        # HTTP proxy for debugging
cask "neohtop"          # System monitor (GUI)
cask "ngrok"            # Tunnel to localhost
cask "vlc"              # Media player

# --- VS Code Extensions ---
vscode "anthropic.claude-code"
vscode "docker.docker"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "koichisasada.vscode-rdbg"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "jakebecker.elixir-ls"
vscode "serayuzgur.crates"
vscode "tamasfe.even-better-toml"
vscode "waderyan.gitblame"
